# Сейчас вы будете выполнять своё первое серьёзное задание, а значит вам предстоит использовать тренажёр на всю катушку. Если возникнут проблемы, воспользуйтесь шпаргалкой. В ней есть ответы на самые распространённые вопросы.
# А теперь — к задаче ⬇️
# Выберите правильные названия переменных для imia, familia и переименуйте их.
# Имя по-английски — first name, given name, name или forename.
# Фамилия по-английски — last name, family name или surname.

first_name = 'Данил'
last_name = 'Марков'
print('Меня зовут ' + first_name + ' ' + last_name + '.')